package day14;
/*
 * [고급]	다음의 문자열 배열이 주어져 있을 때,
		String[] words = {
			"KOREA", "INFORMATION", "TECHNOLOGY", "FIGHTING", "YG"
		};

	인덱스를 난수 발생(0~4 사이의 정수)해서 이 배열에서 단어(문자열) 하나를 (랜덤하게) 지정하고,
	알파벳을 입력해서 단어를 맞히는 게임을 만들어 보세요.

	(실행결과의 예)	단어에 포함된 알파벳을 입력하거나 정답을 입력 : A (엔터)
			1번째 시도 -> ____A
			단어에 포함된 알파벳을 입력하거나 정답을 입력 : E (엔터)
			2번째 시도 -> ___EA
			단어에 포함된 알파벳을 입력하거나 정답을 입력 : B (엔터)
			3번째 시도 -> (실패)
			단어에 포함된 알파벳을 입력하거나 정답을 입력 : K (엔터)
			4번째 시도 -> K__EA
			단어에 포함된 알파벳을 입력하거나 정답을 입력 : KOREA (엔터)
			5번째 시도 -> 맞혔습니다! KOREA!
 * 
 * 
 */
public class Q1407 {

}
